# ViewBackClipping Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewBackClipping Property
ParameterTypeId Class See Also
---
"Depth Clipping"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewBackClipping { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewBackClipping As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewBackClipping {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace